nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/usb/processor/usb_p32mk0512gpe064.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _USB_P32MK0512GPE064_H
#define _USB_P32MK0512GPE064_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    USB_ID_1 = _USB_BASE_ADDRESS,
    USB_NUMBER_OF_MODULES = 1

} USB_MODULE_ID;

typedef enum {

    USB_INT_DEVICE_RESET = 0x01,
    USB_INT_ERROR = 0x02,
    USB_INT_TOKEN_DONE = 0x08,
    USB_INT_IDLE_DETECT = 0x10,
    USB_INT_STALL = 0x80,
    USB_INT_SOF = 0x04,
    USB_INT_HOST_DETACH = 0x01,
    USB_INT_RESUME = 0x20,
    USB_INT_ATTACH = 0x40,
    USB_INT_ANY = 0xFF,
    USB_INT_ALL = 0xFF

} USB_INTERRUPTS;

typedef enum {

    USB_ERR_INT_PID_CHECK_FAILURE = 0x01,
    USB_ERR_INT_BAD_CRC5 = 0x02,
    USB_ERR_INT_BAD_CRC16 = 0x04,
    USB_ERR_INT_BAD_DATA_FIELD_SIZE = 0x08,
    USB_ERR_INT_BUS_TURNAROUND_TIMEOUT = 0x10,
    USB_ERR_INT_BIT_STUFF_ERROR = 0x80,
    USB_ERR_INT_HOST_EOF_ERROR = 0x02,
    USB_ERR_INT_DMA_ERROR = 0x20,
    USB_ERR_INT_BUS_MATRIX_ERROR = 0x40,
    USB_ERR_INT_ANY = 0xFF,
    USB_ERR_INT_ALL = 0xFF

} USB_ERROR_INTERRUPTS;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/usb_OTG_InterruptStatus_Default.h"
#include "../templates/usb_OTG_Interrupt_Default.h"
#include "../templates/usb_OTG_IDPinState_Default.h"
#include "../templates/usb_OTG_LineState_Default.h"
#include "../templates/usb_OTG_SessionValid_Default.h"
#include "../templates/usb_OTG_BSessionEnd_Default.h"
#include "../templates/usb_OTG_ASessionValid_Default.h"
#include "../templates/usb_OTG_PullUpPullDown_Default.h"
#include "../templates/usb_OTG_VbusPowerOnOff_Default.h"
#include "../templates/usb_OTG_VbusCharge_Default.h"
#include "../templates/usb_OTG_VbusDischarge_Default.h"
#include "../templates/usb_ActivityPending_Default.h"
#include "../templates/usb_SleepEntryGuard_Default.h"
#include "../templates/usb_ModuleBusy_Default.h"
#include "../templates/usb_Suspend_Default.h"
#include "../templates/usb_ModulePower_32Bit16Bit.h"
#include "../templates/usb_GEN_InterruptStatus_Default.h"
#include "../templates/usb_GEN_Interrupt_Default.h"
#include "../templates/usb_ALL_Interrupt_Default.h"
#include "../templates/usb_ERR_InterruptStatus_Default.h"
#include "../templates/usb_ERR_Interrupt_Default.h"
#include "../templates/usb_LastEndpoint_Default.h"
#include "../templates/usb_LastDirection_Default.h"
#include "../templates/usb_LastPingPong_Default.h"
#include "../templates/usb_LastTransactionDetails_Default.h"
#include "../templates/usb_LiveJState_Default.h"
#include "../templates/usb_LiveSingleEndedZero_Default.h"
#include "../templates/usb_PacketTransfer_Default.h"
#include "../templates/usb_HostBusyWithToken_Default.h"
#include "../templates/usb_HostGeneratesReset_Default.h"
#include "../templates/usb_OpModeSelect_Default.h"
#include "../templates/usb_ResumeSignaling_Default.h"
#include "../templates/usb_BufferFreeze_Default.h"
#include "../templates/usb_StartOfFrames_Default.h"
#include "../templates/usb_NextTokenSpeed_Default.h"
#include "../templates/usb_DeviceAddress_Default.h"
#include "../templates/usb_FrameNumber_Default.h"
#include "../templates/usb_TokenPID_Default.h"
#include "../templates/usb_TokenEP_Default.h"
#include "../templates/usb_SOFThreshold_Default.h"
#include "../templates/usb_BDTBaseAddress_Default.h"
#include "../templates/usb_EyePattern_Default.h"
#include "../templates/usb_StopInIdle_Default.h"
#include "../templates/usb_AutomaticSuspend_Default.h"
#include "../templates/usb_PingPongMode_Unsupported.h"
#include "../templates/usb_UOEMonitor_Unsupported.h"
#include "../templates/usb_OnChipPullup_Unsupported.h"
#include "../templates/usb_OnChipTransceiver_Unsupported.h"
#include "../templates/usb_SpeedControl_Unsupported.h"
#include "../templates/usb_EP0LowSpeedConnect_Default.h"
#include "../templates/usb_EP0NAKRetry_Default.h"
#include "../templates/usb_EPnTxRx_Default.h"
#include "../templates/usb_EPnRxEnableEnhanced_PIC32.h"
#include "../templates/usb_BDTFunctions_PIC32.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagSet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptFlagSet_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptFlagClear(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptFlagClear_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptFlagGet(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     return USB_OTG_InterruptFlagGet_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_InterruptStatus(USB_MODULE_ID index)
{
     return USB_ExistsOTG_InterruptStatus_Default(index);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptEnable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptEnable_Default(index, interruptFlag);
}

PLIB_INLINE_API void PLIB_USB_OTG_InterruptDisable(USB_MODULE_ID index, USB_OTG_INTERRUPTS interruptFlag)
{
     USB_OTG_InterruptDisable_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_OTG_InterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
     return USB_OTG_InterruptIsEnabled_Default(index, interruptFlag);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_Interrupt(USB_MODULE_ID index)
{
     return USB_ExistsOTG_Interrupt_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_IDPinStateIsTypeA(USB_MODULE_ID index)
{
     return USB_OTG_IDPinStateIsTypeA_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_IDPinState(USB_MODULE_ID index)
{
     return USB_ExistsOTG_IDPinState_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_OTG_LineStateIsStable(USB_MODULE_ID index)
{
     return USB_OTG_LineStateIsStable_Default(index);
}

